
# tap repositories and their packages

tap 'homebrew/core'
brew 'automake' # Tool for generating GNU Standards-compliant Makefiles
brew 'awscli' # Official Amazon AWS command-line interface
brew 'bash' # Bourne-Again SHell, a UNIX command interpreter
brew 'bash-completion@2' # Programmable completion for Bash 4.2+
brew 'buildkit' # Concurrent, cache-efficient, and Dockerfile-agnostic builder toolkit
brew 'ccat' # Like cat but displays content with syntax highlighting
brew 'clive' # Automates terminal operations
brew 'cmake' # Cross-platform make
brew 'colima' # Container runtimes on MacOS (and Linux) with minimal setup
brew 'colordiff' # Color-highlighted diff(1) output
brew 'direnv' # Load/unload environment variables based on $PWD
brew 'docker' # Pack, ship and run any application as a lightweight container
brew 'docker-buildx' # Docker CLI plugin for extended build capabilities with BuildKit
brew 'dust' # More intuitive version of du in rust
brew 'ffmpeg' # Play, record, convert, and stream select audio and video codecs
brew 'fish' # User-friendly command-line shell for UNIX-like operating systems
brew 'flock' # Lock file during command
brew 'gcc@11' # GNU compiler collection
brew 'gh' # GitHub command-line tool
brew 'ghq' # Remote repository management made easy
brew 'git' # Distributed revision control system
brew 'git-lfs' # Git extension for versioning large files
brew 'gnupg' # GNU Privacy Guard (OpenPGP)
brew 'golang' #
brew 'imagemagick' # Tools and libraries to manipulate images in select formats
brew 'infracost' # Cost estimates for Terraform
brew 'jnv' # Interactive JSON filter using jq
brew 'jq' # Lightweight and flexible command-line JSON processor
brew 'latex2rtf' # Translate LaTeX to RTF
brew 'lazygit' # Simple terminal UI for git commands
brew 'lima' # Linux virtual machines
brew 'llama.cpp' # LLM inference in C/C++
brew 'luarocks' # Package manager for the Lua programming language
brew 'lume' # Create and manage Apple Silicon-native virtual machines
brew 'mas' # Mac App Store command-line interface
brew 'mise' # Polyglot runtime manager (asdf rust clone)
brew 'mosh' # Remote terminal application
brew 'msgpack' # Library for a binary-based efficient data interchange format
brew 'multitime' # Time command execution over multiple executions
brew 'neovim' # Ambitious Vim-fork focused on extensibility and agility
brew 'node' # Open-source, cross-platform JavaScript runtime environment
brew 'nodeenv' # Node.js virtual environment builder
brew 'nodenv' # Node.js version manager
brew 'optipng' # PNG file optimizer
brew 'pandoc' # Swiss-army knife of markup format conversion
brew 'pip-completion' # Bash completion for Pip
brew 'pipgrip' # Lightweight pip dependency resolver
brew 'pkgconf' # Package compiler and linker metadata toolkit
brew 'plantuml' # Draw UML diagrams
brew 'pre-commit' # Framework for managing multi-language pre-commit hooks
brew 'procs' # Modern replacement for ps written in Rust
brew 'python@3.13' # Interpreted, interactive, object-oriented programming language
brew 'ripgrep' # Search tool like grep and The Silver Searcher
brew 'ruby' # Powerful, clean, object-oriented scripting language
brew 'ruby-completion' # Bash completion for Ruby
brew 'rust' # Safe, concurrent, practical language
brew 'rustup' # Rust toolchain installer
brew 'screen' # Terminal multiplexer with VT100/ANSI terminal emulation
brew 'shellcheck' # Static analysis and lint tool, for (ba)sh scripts
brew 'socat' # SOcket CAT: netcat on steroids
brew 'spark' # Sparklines for the shell
brew 'terraform-docs' # Tool to generate documentation from Terraform modules
brew 'terragrunt' # Thin wrapper for Terraform e.g. for locking state
brew 'terrascan' # Detect compliance and security violations across Infrastructure as Code
brew 'texlive' # Free software distribution for the TeX typesetting system
brew 'tfenv' # Terraform version manager inspired by rbenv
brew 'tflint' # Linter for Terraform files
brew 'tfsec' # Static analysis security scanner for your terraform code
brew 'tfupdate' # Update version constraints in your Terraform configurations
brew 'tig' # Text interface for Git repositories
brew 'trivy' # Vulnerability scanner for container images, file systems, and Git repos
brew 'ttyd' # Command-line tool for sharing terminal over the web
brew 'utf8proc', args: ['HEAD'] # Clean C library for processing UTF-8 Unicode data
brew 'vim' # Vi 'workalike' with many additional features
brew 'wget' # Internet file retriever
brew 'zellij' # Pluggable terminal workspace, with terminal multiplexer as the base feature
brew 'zsh' # UNIX shell (command interpreter)
brew 'zsh-completions' # Additional completion definitions for zsh

tap 'homebrew/cask'
cask 'accessmenubarapps' # Instant access for menubar apps
cask 'alt-tab' # Enable Windows-like alt-tab
cask 'antigravity' # AI Coding Agent IDE
cask 'bettertouchtool' # Tool to customise input devices and automate computer systems
cask 'caffeine' # Utility that prevents the system from going to sleep
cask 'clipy' # Clipboard extension app
cask 'cursor' # Write, edit, and chat about your code with AI
cask 'google-japanese-ime' # Japanese input software
cask 'hammerspoon' # Desktop automation application
cask 'hhkb-studio' # Customize keymap, shortcuts, and gesture pad behavior on HHKB Studio
cask 'iterm2' # Terminal emulator as alternative to Apple's Terminal app
cask 'karabiner-elements' # Keyboard customiser
cask 'keyboard-cleaner' # Desktop shield and keystroke interceptor
cask 'licecap' # Animated screen capture application
cask 'microsoft-edge' # Multi-platform web browser
cask 'microsoft-office' # Office suite
cask 'miniconda' # Minimal installer for conda
cask 'notion' # App to write, plan, collaborate, and get organised
cask 'obsidian' # Knowledge base that works on top of a local folder of plain text Markdown files
cask 'rapidapi' # HTTP client that helps testing and describing APIs
cask 'raspberry-pi-imager' # Imaging utility to install operating systems to a microSD card
cask 'tailscale-app' # Mesh VPN based on WireGuard
cask 'unnaturalscrollwheels' # Tool to invert scroll direction for physical scroll wheels
cask 'visual-studio-code' # Open-source code editor
cask 'vscodium' # Binary releases of VS Code without MS branding/telemetry/licensing
cask 'wezterm' # GPU-accelerated cross-platform terminal emulator and multiplexer
cask 'windows-app' # Connect to Windows
cask 'zoom' # Video communication and virtual meeting platform

tap 'hashicorp/tap'
brew 'hashicorp/tap/packer' # Packer

tap 'rcmdnk/file'
brew 'rcmdnk/file/brew-file' # Brewfile manager for Homebrew.

tap 'rcmdnk/rcmdnkcask'
cask 'rcmdnk/rcmdnkcask/vem' #

tap 'rcmdnk/rcmdnkpac'
brew 'rcmdnk/rcmdnkpac/chatgpt-prompt-wrapper' # Python CLI implementation for ChatGPT.
