# Tap repositories and their packages
tap 'homebrew/dupes'

tap 'homebrew/versions'

tap 'phinze/cask'

tap 'rcmdnk/brewall'

tap 'thoughtbot/formulae'


# Cask packages
cask 'adobe-reader'
cask 'alfred'
cask 'appcleaner'
cask 'audacity'
cask 'bathyscaphe'
cask 'bettertouchtool'
cask 'caffeine'
cask 'callnote'
cask 'candybar'
cask 'cathode'
cask 'cheatsheet'
cask 'clamxav'
cask 'clipmenu'
cask 'cloud'
cask 'cooviewer'
cask 'copy'
cask 'cyberduck'
cask 'deeper'
cask 'disk-drill'
cask 'dropbox'
cask 'dupscanub'
cask 'evasi0n'
cask 'evernote'
cask 'filezilla'
cask 'firefox'
cask 'flip4mac'
cask 'fluid'
cask 'flux'
cask 'geektool'
cask 'gimp'
cask 'github'
cask 'google-chrome'
cask 'google-drive'
cask 'google-japanese-ime'
cask 'google-notifier'
cask 'gyazo'
cask 'hyperswitch'
cask 'icefloor'
cask 'iexplorer'
cask 'ifunbox'
cask 'imageoptim'
cask 'img2icns'
cask 'iterm2'
cask 'keyboardcleantool'
cask 'keyremap4macbook'
cask 'kuaipan'
cask 'launchbar'
cask 'licecap'
cask 'linein'
cask 'liteicon'
cask 'madruby'
cask 'magican'
cask 'mendeley-desktop'
cask 'menubarfilter'
cask 'meteorologist'
cask 'mou'
cask 'netbeans'
cask 'netnewswire'
cask 'nocturne'
cask 'notational-velocity'
cask 'onyx'
cask 'openoffice'
cask 'picasa'
cask 'quicksilver'
cask 'rightzoom'
cask 'secondbar'
cask 'simplecap'
cask 'simplefloatingclock'
cask 'skim'
cask 'skitch'
cask 'skydrive'
cask 'skype'
cask 'slate'
cask 'smcfancontrol'
cask 'spark'
cask 'startninja'
cask 'synergy'
cask 'teamviewer'
cask 'the-unarchiver'
cask 'thunderbird'
cask 'timemachineeditor'
cask 'tinkertool'
cask 'ukelele'
cask 'virtualbox'
cask 'vlc'
cask 'wireshark'
cask 'xquartz'
cask 'xrg'
cask 'xtrafinder'
cask 'yorufukurou'
cask 'zipeg'

# Other Homebrew packages
brew 'autoconf'
brew 'automake'
brew 'bash'
brew 'bash-completion'
brew 'bdw-gc'
brew 'boost'
brew 'brew-cask'
brew 'brewall'
brew 'checkbashisms'
brew 'colordiff'
brew 'cscope'
brew 'dash'
brew 'freetype'
brew 'gdbm'
brew 'git'
brew 'gitsh'
brew 'imagemagick'
brew 'jpeg'
brew 'libevent'
brew 'libpng'
brew 'libtool'
brew 'lua'
brew 'macvim --with-lua'
brew 'mercurial'
brew 'openssl'
brew 'pkg-config'
brew 'python'
brew 'readline'
brew 'sqlite'
brew 'stow'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'w3m'
brew 'wdiff'
brew 'wget'
brew 'xz'
