
# tap repositories and their packages

tap 'homebrew/core'
brew 'automake'
brew 'bash-completion@2'
brew 'ccat'
brew 'cmake'
brew 'colordiff'
brew 'dust'
brew 'fish'
brew 'gcc@11'
brew 'gh'
brew 'ghq'
brew 'git'
brew 'git-lfs'
brew 'golang'
brew 'imagemagick'
brew 'jnv'
brew 'jq'
brew 'latex2rtf'
brew 'llama.cpp'
brew 'mise'
brew 'neovim'
brew 'node'
brew 'nodeenv'
brew 'nodenv'
brew 'pandoc'
brew 'pip-completion'
brew 'pipgrip'
brew 'pkgconf'
brew 'poetry'
brew 'python@3.13'
brew 'ripgrep'
brew 'ruby'
brew 'ruby-completion'
brew 'rust'
brew 'rustup'
brew 'screen'
brew 'shellcheck'
brew 'socat'
brew 'spark'
brew 'tig'
brew 'utf8proc', args: ['HEAD']
brew 'vim'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'

tap 'rcmdnk/file'
brew 'rcmdnk/file/brew-file'

tap 'rcmdnk/rcmdnkpac'
brew 'rcmdnk/rcmdnkpac/chatgpt-prompt-wrapper'
